src/InformationRegisters/АдресатыКонтрагентов/АдресатыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресатыКонтрагентов</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДвоичныеДанныеФайлов/ДвоичныеДанныеФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДвоичныеДанныеФайлов</name>
  <resources>
    <name>ДвоичныеДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИсходящееПисьмо/ИсходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящееПисьмо</name>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Catalog.ПроектныеЗадачи</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <basedOn>Catalog.Мероприятия</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.УведомленияПрограммы</basedOn>
  <basedOn>Document.Отсутствие</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпособаАдресации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОснование</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовленоКОтправке</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПисьмаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВидаМаршрутизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/СтатусЗадачНаВыполнение/СтатусЗадачНаВыполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусЗадачНаВыполнение</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ПолученОтвет</name>
      <description>Получен ответ</description>
    </items>
    <items>
      <name>Принята</name>
      <description>Принята</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>Контактная информация справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникЛичныеАдресаты</name>
      <description>Контактная информация справочника &quot;Личные адресаты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникРолиИсполнителей</name>
      <description>Контактная информация справочника &quot;Роли исполнителей&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
    <items>
      <name>УдалитьДругаяИнформацияОрганизации</name>
      <description>Другое</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/млкПодпискиНаСобытия/Module.bsl
Функция ПолучитьАдресат(Пользователь) Экспорт
	КонтИнфо = ПолучитьКонтактнуюИнформацияОбъекта(Пользователь);
	Возврат   ВстроеннаяПочтаСервер.ПолучитьПочтовогоАдресата(КонтИнфо.Емайл);
КонецФункции

Процедура ДокументВходящееПисьмоПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	АдресатСистемыПоддержки = Константы.АдресатСистемыПоддержки.Получить();
	ИскомаяСтрока = Неопределено;
	МассивСтрок = Источник.ПолучателиПисьма.НайтиСтроки(Новый Структура("Адресат", АдресатСистемыПоддержки));
	Если МассивСтрок.Количество() = 0 Тогда
		//ИскомаяСтрока = МассивСтрок[0];
		Возврат;
	КонецЕсли;
	Если Источник.ОтправительАдресат =  АдресатСистемыПоддержки 
		или Источник.ОтправительАдресат.Адрес = "mailer-daemon@yandex.ru" Тогда
		Возврат;
	КонецЕСли;	
	Тема = Источник.Тема;
	Если Найти(Тема, "Ошибка исполнения задачи по почте:") > 0 Тогда
		Возврат;
	КонецЕсли;	
	
	НомерСимвола = Найти(Тема,"[#");
	
	Если НЕ НомерСимвола = 0
		И Задачи.ЗаявкаНаВыполнение.НайтиПоНомеру(Сред(Тема,НомерСимвола + 2,9)).Письма.Количество()>30 Тогда
		Возврат;
	КонецЕсли;
	
	Проверка = Найти(Тема,"Автоматический ответ");
	Если НЕ Проверка = 0 тогда
		Возврат;
	КонецЕсли;
	
	Если НомерСимвола = 0 Тогда // Новое письмо
		НовЗадача = Задачи.ЗаявкаНаВыполнение.СоздатьЗадачу();
		НовЗадача.Тема = Тема;
		Если СокрЛП(Тема) <> "" Тогда
			НовЗадача.Наименование = Лев(Тема,25);
		Иначе
			НовЗадача.Наименование = "Без темы";
		КонецЕсли;
		НовЗадача.Содержание = Источник.ТекстПисьмаПростойТекстХранилище.Получить();
		ИсполнительПоУмолчанию = Константы.ИсполнительЗадачиПоУмолчанию.Получить();
		НовЗадача.АдресацияИсполнитель = ИсполнительПоУмолчанию;
		НовЗадача.Статус = Справочники.СтатусЗадачНаВыполнение.Принята;
		НовЗадача.Дата = Источник.Дата;
		НовЗадача.АдресацияИнициатор = Источник.ОтправительАдресат;
		НовСтр = НовЗадача.Письма.Добавить();
		НовСтр.Письмо = Источник.Ссылка;
		
		АдресатСистемыПоддержки = Константы.АдресатСистемыПоддержки.Получить();
		
		НС =  НовЗадача.Получатели.Добавить();
		НС.Оповещать = Истина;
		НС.Адресат = Источник.ОтправительАдресат;
		
		Для Каждого Стр Из Источник.ПолучателиПисьма Цикл
			Если  Стр.Адресат <> АдресатСистемыПоддержки Тогда
				НС =  НовЗадача.Получатели.Добавить();
				НС.Оповещать = Истина;
				НС.Адресат = Стр.Адресат;
			КонецЕсли;
		КонецЦикла;	
		
		Для Каждого Стр Из Источник.ПолучателиКопий Цикл
			Если  Стр.Адресат <> АдресатСистемыПоддержки Тогда
				НС =  НовЗадача.Получатели.Добавить();
				НС.Оповещать = Истина;
				НС.Адресат = Стр.Адресат;
			КонецЕсли;
		КонецЦикла;
		
		//++Балюк 01.02.23
		НовЗадача.АдресацияКонтрагент = ПолучитьКонтрагента(Источник.ОтправительАдресат);
		//--Балюк 01.02.23
		
		НовЗадача.Записать();
		
		НомерНовойЗадачи = НовЗадача.Номер;     
		
		Если Ложь Тогда  
			
			ТекДата = ТекущаяДата();
			ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент(); 
			НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
			НовСтрПолучатель.Адресат = Источник.ОтправительАдресат;
			ИсходящееПисьмо.Дата = ТекДата;
			ИсходящееПисьмо.Тема = "RE:" + Тема + " [#" + НомерНовойЗадачи + "]";
			
			// ВРЕМЕННЫЙ текст на случай, если ИИ-обработка задержится/упадёт —
			// письмо не должно "зависнуть" неотправленным без ПодготовленоКОтправке
			ИсходящееПисьмо.ТекстХранилище = Новый ХранилищеЗначения(
			"Ваше обращение принято, ему присвоен номер [#" + НомерНовойЗадачи + "].");
			ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить(); 
			ИсходящееПисьмо.ПодготовленоКОтправке  = ТекДата;
			ИсходящееПисьмо.Записать(); // ПодготовленоКОтправке НЕ ставим — письмо ещё не готово к отправке
			
			// Запускаем фоновое формирование "человечного" ответа с ИИ-анализом.
			// По завершении фон сам допишет текст и выставит ПодготовленоКОтправке.
			ИмяОтправителя = "Уважаемый пользователь";//ИзвлечьИмяОтправителя(Источник.ОтправительАдресат);
			
			ПараметрыВыполненияИИ = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыВыполненияИИ.ОжидатьЗавершение = 0;
			//ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполненияИИ,
			//"млкАнализОбращенийИИ.СформироватьИОтправитьЧеловечныйОтвет",
			//ИсходящееПисьмо.Ссылка,
			//НовЗадача.Содержание,
			//ИмяОтправителя,
			//НомерНовойЗадачи,
			//ИсполнительПоУмолчанию);
			
		Иначе	
			
			ТекДата = ТекущаяДата();
			ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент(); 
			НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
			НовСтрПолучатель.Адресат = Источник.ОтправительАдресат;
			ИсходящееПисьмо.ПодготовленоКОтправке  = ТекДата;
			ИсходящееПисьмо.Дата = ТекДата;
			ИсходящееПисьмо.Тема = "RE:" + Тема + " [#" + НомерНовойЗадачи + "]";
			ХранилищеТекста = Новый ХранилищеЗначения("По вашему письму создана задача: [#" + НомерНовойЗадачи + "]
			|Если Вы желаете, прислать дополнительную информацию,  получить уточнения и т. п. необходимо ответить на данное письмо, с сохранением темы.
			|В теме содержиться номер задачи который позволяет сопоставлять полученные письма с уже созданной задачей.");
			
			ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
			ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
			ИсходящееПисьмо.Записать();
			
			//ОповеститьОСоздании(НовЗадача.Ссылка, Источник.Ссылка);
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыВыполнения.ОжидатьЗавершение = 0;
			РезультатЗапуска = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "млкПодпискиНаСобытия.ОповеститьОСоздании", НовЗадача.Ссылка, Источник.Ссылка);
		КонецЕсли;
	Иначе  //****** Найдем существующую задачу *******
		НомерЗадачи = Сред(Тема,НомерСимвола + 2,9);
		ТекЗадача = Задачи.ЗаявкаНаВыполнение.НайтиПоНомеру(НомерЗадачи);
		Если ЗначениеЗаполнено(ТекЗадача) Тогда
			
			АдресатИсполнитель = ПолучитьАдресат(ТекЗадача.АдресацияИсполнитель);
			
			Об = ТекЗадача.ПолучитьОбъект();
			Стр = Об.Письма.Добавить();
			Стр.Письмо = Источник.Ссылка;
			Если Источник.ОтправительАдресат <> АдресатИсполнитель
				И Найти(Источник.Комментарий,"Ответ создан в заявке на выполнение") = 0 Тогда
				 Об.Статус = Справочники.СтатусЗадачНаВыполнение.ПолученОтвет;
			КонецЕсли;

			Об.Записать();
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыВыполнения.ОжидатьЗавершение = 0;
			РезультатЗапуска = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "млкПодпискиНаСобытия.ОповеститьОбОтвете", ТекЗадача, Источник.Ссылка);
	
						
		КонецЕсли;	  
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьКонтактнуюИнформацияОбъекта(Пользователь)
	
	КонтактнаяИнформация = Новый Структура;
	Емайл = "";Телефон = "";
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Емайл = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Пользователь, 
		Справочники.ВидыКонтактнойИнформации.EmailПользователя);
		Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Пользователь, 
		Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
	ИначеЕсли ТипЗнч(Пользователь) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Емайл = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Пользователь, 
		Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);
		Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Пользователь, 
		Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	ИначеЕсли ТипЗнч(Пользователь) = Тип("СправочникСсылка.Контрагенты") Тогда
		Емайл = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Пользователь, 
		Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
		Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Пользователь, 
		Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Телефон) Тогда 
		КонтактнаяИнформация.Вставить("Телефон", СтрШаблон(
		НСтр("ru = 'Телефон: %1'"), Телефон));	
	Иначе
		КонтактнаяИнформация.Вставить("Телефон", Телефон);
	КонецЕсли;			
	
	КонтактнаяИнформация.Вставить("Емайл", Емайл);
	
	Возврат КонтактнаяИнформация;
	
КонецФункции

Функция ПолучитьКонтрагента(Адресат)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	АдресатыКонтрагентов.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.АдресатыКонтрагентов КАК АдресатыКонтрагентов
	               |ГДЕ
	               |	АдресатыКонтрагентов.Адресат = &Адресат";
	Запрос.УстановитьПараметр("Адресат",СокрЛП(Адресат));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;

	Запрос.Текст = "ВЫБРАТЬ
	               |	АдресатыКонтрагентов.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.АдресатыКонтрагентов КАК АдресатыКонтрагентов
	               |ГДЕ
	               |	&Адресат ПОДОБНО ""%"" + АдресатыКонтрагентов.Адресат + ""%""";
	Запрос.УстановитьПараметр("Адресат",СокрЛП(Адресат));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОповеститьОбОтвете(ТекЗадача, Источник) Экспорт
	ТекДата = ТекущаяДата();
	
	Пока ТекущаяДата() < (ТекДата + 15) Цикл
		
	КонецЦикла;
	
	ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент(); 
	
	Для Каждого СТ ИЗ ТекЗадача.Получатели Цикл
		Если  СТ.Адресат <> Источник.ОтправительАдресат И СТ.Оповещать Тогда
			НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
			НовСтрПолучатель.Адресат = СТ.Адресат;	
		КонецЕСли;
	КонецЦикла;
	
	ИсходящееПисьмо.Дата = ТекДата;
	ИсходящееПисьмо.Тема = Источник.Тема;
	ХранилищеТекста = Источник.ТекстПисьмаПростойТекстХранилище;
	ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
	ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
	ИсходящееПисьмо.ТекстПисьмаHTMLХранилище = Источник.ТекстПисьмаHTMLХранилище;
	ИсходящееПисьмо.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Файлы.Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла";
	Запрос.УстановитьПараметр("ВладелецФайла",Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Файл = Выборка.Ссылка.ПолучитьОбъект();
		Версия = Файл.ТекущаяВерсия.ПолучитьОбъект();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла
		|ИЗ
		|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|ГДЕ
		|	ДвоичныеДанныеФайлов.Файл = &ВерсияФайла
		|	И ДвоичныеДанныеФайлов.Файл.Размер > 5000";
		Запрос.УстановитьПараметр("ВерсияФайла",Версия.Ссылка);
		ВыборкаДанных = Запрос.Выполнить().Выбрать();
		Если ВыборкаДанных.Следующий() Тогда
			НовыйФайл = Файл.Скопировать();
			НовыйФайл.ВладелецФайла = ИсходящееПисьмо.Ссылка;
			
			UID	= Новый УникальныйИдентификатор();
			СсылкаНа = Справочники.Файлы.ПолучитьСсылку(UID);
			
			НовыйФайл.УстановитьСсылкуНового(СсылкаНа);
			
			НоваяВерсия = Версия.Скопировать();
			НоваяВерсия.Владелец = СсылкаНа;
			АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Версия.ФайлХранилище.Получить(), Новый УникальныйИдентификатор());
			НоваяВерсия.ФайлХранилище = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
			НоваяВерсия.Записать();
			
			НовыйФайл.ТекущаяВерсия = НоваяВерсия.Ссылка;
			НовыйФайл.ТекущаяВерсияКод = НоваяВерсия.Код;
			НовыйФайл.Записать();
			
			Набор = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьНаборЗаписей();
			Набор.Отбор.Файл.Установить(НоваяВерсия.Ссылка);
			Запись = Набор.Добавить();
			Запись.Файл = НоваяВерсия.Ссылка;
			Запись.ДвоичныеДанныеФайла = ВыборкаДанных.ДвоичныеДанныеФайла;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ИсходящееПисьмо.ПодготовленоКОтправке  = ТекущаяДата();
	ИсходящееПисьмо.Записать();
КонецПроцедуры

Процедура ОповеститьОСоздании(НовЗадача, Источник) Экспорт
	ТекДата = ТекущаяДата();
	
	Пока ТекущаяДата() < (ТекДата + 15) Цикл
		
	КонецЦикла;
	
	ИсполнительПоУмолчанию = Константы.ИсполнительЗадачиПоУмолчанию.Получить();
	НомерНовойЗадачи = НовЗадача.Номер;
	
	ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент(); 
	НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
	НовСтрПолучатель.Адресат = ПолучитьАдресат(ИсполнительПоУмолчанию);
	ИсходящееПисьмо.Дата = ТекДата;
	ИсходящееПисьмо.Тема = "Новая задача: " + Источник.Тема + " [#" + НомерНовойЗадачи + "]";
	ХранилищеТекста = Источник.ТекстПисьмаПростойТекстХранилище;
	ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
	ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
	ИсходящееПисьмо.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Файлы.Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла";
	Запрос.УстановитьПараметр("ВладелецФайла",Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Файл = Выборка.Ссылка.ПолучитьОбъект();
		Версия = Файл.ТекущаяВерсия.ПолучитьОбъект();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла
		|ИЗ
		|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|ГДЕ
		|	ДвоичныеДанныеФайлов.Файл = &ВерсияФайла
		|	И ДвоичныеДанныеФайлов.Файл.Размер > 5000";
		Запрос.УстановитьПараметр("ВерсияФайла",Версия.Ссылка);
		ВыборкаДанных = Запрос.Выполнить().Выбрать();
		Если ВыборкаДанных.Следующий() Тогда
			НовыйФайл = Файл.Скопировать();
			НовыйФайл.ВладелецФайла = ИсходящееПисьмо.Ссылка;
			НовыйФайл.Записать();
			
			НоваяВерсия = Версия.Скопировать();
			НоваяВерсия.Владелец = НовыйФайл.Ссылка;
			АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Версия.ФайлХранилище.Получить(), Новый УникальныйИдентификатор());
			НоваяВерсия.ФайлХранилище = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
			НоваяВерсия.Записать();
			
			НовыйФайл.ТекущаяВерсия = НоваяВерсия.Ссылка;
			НовыйФайл.ТекущаяВерсияКод = НоваяВерсия.Код;
			НовыйФайл.Записать();
			
			Набор = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьНаборЗаписей();
			Набор.Отбор.Файл.Установить(НоваяВерсия.Ссылка);
			Запись = Набор.Добавить();
			Запись.Файл = НоваяВерсия.Ссылка;
			Запись.ДвоичныеДанныеФайла = ВыборкаДанных.ДвоичныеДанныеФайла;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;	
	
	ИсходящееПисьмо.ПодготовленоКОтправке  = ТекущаяДата();
	ИсходящееПисьмо.Записать();
	
КонецПроцедуры
